In [262]:
#импортируем библиотеки
%matplotlib inline
from matplotlib import pyplot as plt
import pandas as pd
import numpy as np

In [263]:
# (1) Используя параметры pandas прочитать красиво пандас 
df = pd.read_csv('UCI_Credit_Card.csv')
# на лекции называли train, а не df - data frame
df.head(4)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0

In [264]:
# (2) выведите, что за типы переменных, сколько пропусков,
df.info(memory_usage=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
ID                            30000 non-null int64
LIMIT_BAL                     30000 non-null float64
SEX                           30000 non-null int64
EDUCATION                     30000 non-null int64
MARRIAGE                      30000 non-null int64
AGE                           30000 non-null int64
PAY_0                         30000 non-null int64
PAY_2                         30000 non-null int64
PAY_3                         30000 non-null int64
PAY_4                         30000 non-null int64
PAY_5                         30000 non-null int64
PAY_6                         30000 non-null int64
BILL_AMT1                     30000 non-null float64
BILL_AMT2                     30000 non-null float64
BILL_AMT3                     30000 non-null float64
BILL_AMT4                     30000 non-null float64
BILL_AMT5                     30000 non-null float64
BILL_AMT6                     30000 non-null float64
PAY_AMT1                      30000 non-null float64
PAY_AMT2                      30000 non-null float64
PAY_AMT3                      30000 non-null float64
PAY_AMT4                      30000 non-null float64
PAY_AMT5                      30000 non-null float64
PAY_AMT6                      30000 non-null float64
default.payment.next.month    30000 non-null int64
dtypes: float64(13), int64(12)
memory usage: 5.7 MB

In [265]:
# для численных значений посчитайте пару статистик (в свободной форме)
df.describe(percentiles=[0.9,0.99]).T

,count,mean,std,min,50%,90%,99%,max
ID,30000.0,15000.500000,8660.398374,1.0,15000.5,27000.1,29700.01,30000.0
LIMIT_BAL,30000.0,167484.322667,129747.661567,10000.0,140000.0,360000.0,500000.00,1000000.0
SEX,30000.0,1.603733,0.489129,1.0,2.0,2.0,2.00,2.0
EDUCATION,30000.0,1.853133,0.790349,0.0,2.0,3.0,5.00,6.0
MARRIAGE,30000.0,1.551867,0.521970,0.0,2.0,2.0,3.00,3.0
AGE,30000.0,35.485500,9.217904,21.0,34.0,49.0,60.00,79.0
PAY_0,30000.0,-0.016700,1.123802,-2.0,0.0,2.0,3.00,8.0
PAY_2,30000.0,-0.133767,1.197186,-2.0,0.0,2.0,3.00,8.0
PAY_3,30000.0,-0.166200,1.196868,-2.0,0.0,2.0,3.00,8.0
PAY_4,30000.0,-0.220667,1.169139,-2.0,0.0,2.0,3.00,8.0
PAY_5,30000.0,-0.266200,1.133187,-2.0,0.0,0.0,3.00,8.0
PAY_6,30000.0,-0.291100,1.149988,-2.0,0.0,2.0,3.00,8.0
BILL_AMT1,30000.0,51223.330900,73635.860576,-165580.0,22381.5,142133.7,350110.68,964511.0
BILL_AMT2,30000.0,49179.075167,71173.768783,-69777.0,21200.0,136905.5,337495.28,983931.0
BILL_AMT3,30000.0,47013.154800,69349.387427,-157264.0,20088.5,132051.3,325030.39,1664089.0
BILL_AMT4,30000.0,43262.948967,64332.856134,-170000.0,19052.0,122418.7,304997.27,891586.0
BILL_AMT5,30000.0,40311.400967,60797.155770,-81334.0,18104.5,115883.0,285868.33,927171.0
BILL_AMT6,30000.0,38871.760400,59554.107537,-339603.0,17071.0,112110.4,279505.06,961664.0
PAY_AMT1,30000.0,5663.580500,16563.280354,0.0,2100.0,10300.0,66522.18,873552.0
PAY_AMT2,30000.0,5921.163500,23040.870402,0.0,2009.0,10401.1,76651.02,1684259.0
PAY_AMT3,30000.0,5225.681500,17606.961470,0.0,1800.0,10000.0,70000.00,896040.0
PAY_AMT4,30000.0,4826.076867,15666.159744,0.0,1500.0,9570.6,67054.44,621000.0
PAY_AMT5,30000.0,4799.387633,15278.305679,0.0,1500.0,9500.0,65607.56,426529.0
PAY_AMT6,30000.0,5215.502567,17777.465775,0.0,1500.0,9600.0,82619.05,528666.0
default.payment.next.month,30000.0,0.221200,0.415062,0.0,0.0,1.0,1.00,1.0

In [266]:
# Выведем сколько данных (строки, столбцы)
df.shape

(30000, 25)

In [267]:
# (3) посчитать число женщин с университетским образованием
# SEX (1 = male; 2 = female). 
# EDUCATION (1 = graduate school; 2 = university; 3 = high school; 4 = others). 
answer = df[
    (df['SEX'] == 2) & (df['EDUCATION'] == 2)
].shape
print('Университетское образование имеет',answer[0], 'женщин')

Университетское образование имеет 8656 женщин

In [268]:
# (4) Сгрупировать по "default payment next month" и посчитать медиану для всех показателей начинающихся на BILL_ и PAY_
line = []
for i in df.columns:
    if ('BILL_') in i:
        line.append(i)
    elif('PAY_') in i:
        line.append(i)
columns_to_show = line
df.groupby(['default.payment.next.month'])[columns_to_show].median()

,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6
default.payment.next.month,,,,,,,,,,,,,,,,,,
0,0,0,0,0,0,0,23119.5,21660.5,20202.5,19000.0,17998.0,16679.0,2459.5,2247.5,2000.0,1734.0,1765.0,1706.0
1,1,0,0,0,0,0,20185.0,20300.5,19834.5,19119.5,18478.5,18028.5,1636.0,1533.5,1222.0,1000.0,1000.0,1000.0

In [269]:
# (5) постройте сводную таблицу (pivot table) по SEX, EDUCATION, MARRIAGE
df.pivot_table('SEX', 'EDUCATION', 'MARRIAGE')

MARRIAGE          0         1         2         3
EDUCATION
0               NaN  1.500000  1.400000       NaN
1          1.750000  1.545943  1.613306  1.400000
2          1.833333  1.653610  1.581197  1.611111
3          1.727273  1.633695  1.531692  1.650485
4               NaN  1.653846  1.661765  1.666667
5               NaN  1.680000  1.637795  1.666667
6               NaN  1.500000  1.476190  2.000000

In [270]:
# (6) Создать новый строковый столбец в data frame-е, который:
# принимает значение A, если значение LIMIT_BAL <=10000
# принимает значение B, если значение LIMIT_BAL <=100000 и >10000
# принимает значение C, если значение LIMIT_BAL <=200000 и >100000
# принимает значение D, если значение LIMIT_BAL <=400000 и >200000
# принимает значение E, если значение LIMIT_BAL <=700000 и >400000
# принимает значение F, если значение LIMIT_BAL >700000
#TODO

In [271]:
# сначала нужно написать функцию, которая выполняет нужный перевод
def A_F_sort(row):
    if (row <= 10000):
        return 'A'
    elif (row <= 100000 and row > 10000):
        return 'B'
    elif (row <= 200000 and row > 100000):
        return 'C'
    elif (row <= 400000 and row > 200000):
        return 'D'
    elif (row <= 700000 and row > 400000):
        return 'E'
    elif (row > 700000):
        return 'F'
#      параметр, входящий в функцию, считается объектом серии, помеченным как "строка".

In [274]:
# используем функцию для решения 6 задачи
df['L_B'] = df['LIMIT_BAL'].map(lambda x: A_F_sort(x))
# выводим результат
df['L_B']

0         20000.0
1        120000.0
2         90000.0
3         50000.0
4         50000.0
5         50000.0
6        500000.0
7        100000.0
8        140000.0
9         20000.0
10       200000.0
11       260000.0
12       630000.0
13        70000.0
14       250000.0
15        50000.0
16        20000.0
17       320000.0
18       360000.0
19       180000.0
20       130000.0
21       120000.0
22        70000.0
23       450000.0
24        90000.0
25        50000.0
26        60000.0
27        50000.0
28        50000.0
29        50000.0
           ...
29970    360000.0
29971     80000.0
29972    190000.0
29973    230000.0
29974     50000.0
29975    220000.0
29976     40000.0
29977    420000.0
29978    310000.0
29979    180000.0
29980     50000.0
29981     50000.0
29982     90000.0
29983     20000.0
29984     30000.0
29985    240000.0
29986    360000.0
29987    130000.0
29988    250000.0
29989    150000.0
29990    140000.0
29991    210000.0
29992     10000.0
29993    100000.0
29994     80000.0
29995    220000.0
29996    150000.0
29997     30000.0
29998     80000.0
29999     50000.0
Name: LIMIT_BAL, Length: 30000, dtype: float64

In [ ]:
# При работе с целочисленными индексами, индекс можно ставить сразу после имени переменной в квадратных скобках 
# (пример: s[1]), или можно воспользоваться .iloc (пример: s.iloc[1]).
# number=0
# df['L_B'] = df['LIMIT_BAL']
# count = df['L_B'].shape[0]
# for number in range(count):
#     print(A_F_sort(df['L_B'].iloc[number]))

In [ ]:
# (7) постироить распределение LIMIT_BAL (гистрограмму)

In [ ]:
df['LIMIT_BAL'].hist(bins=30) #TODO

In [261]:
# (8) построить среднее значение кредитного лимита для каждого вида образования 
# и для каждого пола
# график необходимо сделать очень широким (на весь экран)
# эффектив пандас книжка 
x = df.groupby(['SEX','EDUCATION']).LIMIT_BAL.MEAN()
# unstack помог
# ширина экрана в plt в лекции был пример plt
# функция отрисовки графика и groupby по столбцам
# df не мог передать в функцию (эстиматор функция бла бла проверить)
# seaborn скатывается к матплотлибу если задание не тривиальное

AttributeError: 'SeriesGroupBy' object has no attribute 'MEAN'

In [ ]:
# (9) построить зависимость кредитного лимита и образования только для одного из полов

#TODO

In [ ]:
# (10) построить большой график (подсказка - используя seaborn) для построения завимисости всех возможных пар параметров
# разным цветом выделить разные значение "default payment next month"
# (но так как столбцов много - картинка может получиться "монструозной")
# (поэкспериментируйте над тем как построить подобное сравнение параметров)
# (подсказка - ответ может состоять из несколькольких графиков)
# (если не выйдет - программа минимум - построить один график со всеми параметрами)
import seaborn as sns
 
#TODO